In [2]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

/kaggle/input/titanic/train.csv
/kaggle/input/titanic/test.csv
/kaggle/input/titanic/gender_submission.csv

In [3]:
# 데이터 불러오기
import pandas as pd
import numpy as np
import random as rnd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [4]:
# 머신러닝
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC, LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import Perceptron
from sklearn.linear_model import SGDClassifier
from sklearn.tree import DecisionTreeClassifier

import warnings
warnings.filterwarnings(action='ignore')

In [9]:
#data 불러오기
train=pd.read_csv("/kaggle/input/titanic/train.csv") #학습용 데이터
test=pd.read_csv("/kaggle/input/titanic/test.csv") #테스트용(제출용) 데이터
train_test=[train,test]

In [10]:
# 변수 보기
print(train.columns.values)

#변수설명
''' 
PassengerId : 각 승객의 고유 번호
Survived : 생존 여부(종속 변수)
    0 = 사망
    1 = 생존
Pclass : 객실 등급 - 승객의 사회적, 경제적 지위
    1st = Upper
    2nd = Middle
    3rd = Lower
Name : 이름
Sex : 성별
Age : 나이
SibSp : 동반한 Sibling와 Spouse의 수
Parch : 동반한 Parent와 Child의 수
Ticket : 티켓의 고유넘버
Fare : 티켓의 요금
Cabin : 객실 번호
Embarked : 승선한 항
    C = Cherbourg
    Q = Queenstown
    S = Southampton'''

['PassengerId' 'Survived' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch'
 'Ticket' 'Fare' 'Cabin' 'Embarked']

' \nPassengerId : 각 승객의 고유 번호\nSurvived : 생존 여부(종속 변수)\n    0 = 사망\n    1 = 생존\nPclass : 객실 등급 - 승객의 사회적, 경제적 지위\n    1st = Upper\n    2nd = Middle\n    3rd = Lower\nName : 이름\nSex : 성별\nAge : 나이\nSibSp : 동반한 Sibling와 Spouse의 수\nParch : 동반한 Parent와 Child의 수\nTicket : 티켓의 고유넘버\nFare : 티켓의 요금\nCabin : 객실 번호\nEmbarked : 승선한 항\n    C = Cherbourg\n    Q = Queenstown\n    S = Southampton'

In [11]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
train.info() #데이터 type과 null유무확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

age, cabin,embarked 값은 null값이 존재 >> 나중에 값을 넣어줘야함

In [13]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

# 데이터분석

In [14]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [15]:
## 성별data를 numeric하게 바꾸기
train['Sex'] = train['Sex'].astype('category').cat.codes
test['Sex'] = test['Sex'].astype('category').cat.codes

train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S

In [16]:
# embarked: 승객이 어떤 항구에서 탔는지
# numeric data로 전환

train['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [17]:
# NAN값은 최빈값은 S로 채우기
train['Embarked'].fillna('S', inplace=True)

train['Embarked'] = train['Embarked'].astype('category').cat.codes
test['Embarked'] = test['Embarked'].astype('category').cat.codes

train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2

In [18]:
#family라는 새로운 열 만들어주기
train['Family'] = 1 + train['SibSp'] + train['Parch']
test['Family'] = 1 + test['SibSp'] + test['Parch']

# 기존 열 삭제
train.drop(['SibSp', 'Parch'], axis=1, inplace=True)
test.drop(['SibSp', 'Parch'], axis=1, inplace=True)

train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Family
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,A/5 21171,7.2500,NaN,2,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,PC 17599,71.2833,C85,0,2
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,STON/O2. 3101282,7.9250,NaN,2,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,113803,53.1000,C123,2,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,373450,8.0500,NaN,2,1

In [19]:
#family가 1일 때는 혼자 탑승한 경우이므로 Solo라는 열 만들어주기
train['Solo'] = (train['Family'] == 1)
test['Solo'] = (test['Family'] == 1)

train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Family,Solo
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,A/5 21171,7.2500,NaN,2,2,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,PC 17599,71.2833,C85,0,2,False
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,STON/O2. 3101282,7.9250,NaN,2,1,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,113803,53.1000,C123,2,2,False
4,5,0,3,"Allen, Mr. William Henry",1,35.0,373450,8.0500,NaN,2,1,True

In [20]:
#Fare은 단순화해주기 위해 Binning 사용
train['FareBin'] = pd.qcut(train['Fare'], 5)
test['FareBin'] = pd.qcut(test['Fare'], 5)

train['FareBin'].value_counts()

FareBin
(7.854, 10.5]        184
(21.679, 39.688]     180
(-0.001, 7.854]      179
(39.688, 512.329]    176
(10.5, 21.679]       172
Name: count, dtype: int64

In [21]:
#이후 numeric하게 변경
train['Fare'] = train['FareBin'].astype('category').cat.codes
test['Fare'] = test['FareBin'].astype('category').cat.codes

train['Fare'].value_counts()

Fare
1    184
3    180
0    179
4    176
2    172
Name: count, dtype: int64

In [23]:
#Name
train['Title'] = train['Name'].str.extract(' ([A-Za-z]+)\.', expand=False)
test['Title'] = test['Name'].str.extract(' ([A-Za-z]+)\.', expand=False)

train['Title'].value_counts()

Title
Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Mlle          2
Major         2
Col           2
Countess      1
Capt          1
Ms            1
Sir           1
Lady          1
Mme           1
Don           1
Jonkheer      1
Name: count, dtype: int64

In [24]:
#데이터 양이 작은 것들은 묶어서 처리
train['Title'] = train['Title'].replace(['Lady', 'Countess','Capt', 'Col','Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Other')
train['Title'] = train['Title'].replace('Mlle', 'Miss')
train['Title'] = train['Title'].replace('Ms', 'Miss')
train['Title'] = train['Title'].replace('Mme', 'Mrs')

train['Title'].value_counts()

Title
Mr        517
Miss      185
Mrs       126
Master     40
Other      23
Name: count, dtype: int64

In [25]:
#test데이터에도 적용
test['Title'] = test['Title'].replace(['Lady', 'Countess','Capt', 'Col','Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Other')
test['Title'] = test['Title'].replace('Mlle', 'Miss')
test['Title'] = test['Title'].replace('Ms', 'Miss')
test['Title'] = test['Title'].replace('Mme', 'Mrs')

test['Title'].value_counts()

Title
Mr        240
Miss       79
Mrs        72
Master     21
Other       6
Name: count, dtype: int64

In [26]:
#numeric하게 변경
train['Title'] = train['Title'].astype('category').cat.codes
test['Title'] = test['Title'].astype('category').cat.codes

train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Family,Solo,FareBin,Title
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,A/5 21171,0,NaN,2,2,False,"(-0.001, 7.854]",2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,PC 17599,4,C85,0,2,False,"(39.688, 512.329]",3
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,STON/O2. 3101282,1,NaN,2,1,True,"(7.854, 10.5]",1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,113803,4,C123,2,2,False,"(39.688, 512.329]",3
4,5,0,3,"Allen, Mr. William Henry",1,35.0,373450,1,NaN,2,1,True,"(7.854, 10.5]",2

In [27]:
#Age
#NAN은 median값으로 채워줌
train["Age"].fillna(train.groupby("Title")["Age"].transform("median"), inplace=True)
test["Age"].fillna(test.groupby("Title")["Age"].transform("median"), inplace=True)

In [28]:
# Train_Test데이터 binning
train_test = [train,test]

for dataset in train_test:
    dataset.loc[dataset['Age'] <= 10, 'Age'] = 0
    dataset.loc[(dataset['Age'] > 10) & (dataset['Age'] <= 16), 'Age'] = 1
    dataset.loc[(dataset['Age'] > 16) & (dataset['Age'] <= 20), 'Age'] = 2
    dataset.loc[(dataset['Age'] > 20) & (dataset['Age'] <= 26), 'Age'] = 3
    dataset.loc[(dataset['Age'] > 26) & (dataset['Age'] <= 30), 'Age'] = 4
    dataset.loc[(dataset['Age'] > 30) & (dataset['Age'] <= 36), 'Age'] = 5
    dataset.loc[(dataset['Age'] > 36) & (dataset['Age'] <= 40), 'Age'] = 6
    dataset.loc[(dataset['Age'] > 40) & (dataset['Age'] <= 46), 'Age'] = 7
    dataset.loc[(dataset['Age'] > 46) & (dataset['Age'] <= 50), 'Age'] = 8
    dataset.loc[(dataset['Age'] > 50) & (dataset['Age'] <= 60), 'Age'] = 9
    dataset.loc[dataset['Age'] > 60, 'Age'] = 10

train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Family,Solo,FareBin,Title
0,1,0,3,"Braund, Mr. Owen Harris",1,3.0,A/5 21171,0,NaN,2,2,False,"(-0.001, 7.854]",2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,6.0,PC 17599,4,C85,0,2,False,"(39.688, 512.329]",3
2,3,1,3,"Heikkinen, Miss. Laina",0,3.0,STON/O2. 3101282,1,NaN,2,1,True,"(7.854, 10.5]",1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,5.0,113803,4,C123,2,2,False,"(39.688, 512.329]",3
4,5,0,3,"Allen, Mr. William Henry",1,5.0,373450,1,NaN,2,1,True,"(7.854, 10.5]",2

In [29]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Family,Solo,FareBin,Title
0,892,3,"Kelly, Mr. James",1,5.0,330911,1,NaN,1,1,True,"(7.796, 11.025]",2
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,8.0,363272,0,NaN,2,2,False,"(-0.001, 7.796]",3
2,894,2,"Myles, Mr. Thomas Francis",1,10.0,240276,1,NaN,1,1,True,"(7.796, 11.025]",2
3,895,3,"Wirz, Mr. Albert",1,4.0,315154,1,NaN,2,1,True,"(7.796, 11.025]",2
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,3.0,3101298,2,NaN,2,3,False,"(11.025, 21.438]",3

In [30]:
#cabin은 뒷 숫자는 무시하고 맨 앞의 알파벳만 가져옴
#Cabin 값은 Alphabet을 가져와서 Numeric한 값으로 변경한 후에 
#Pclass로 Group한 median값을 일괄 적용해줌 >> Pclass는 객실 등급이고 cabin은 객실번호
train['Cabin'].str[:1].value_counts()

Cabin
C    59
B    47
D    33
E    32
A    15
F    13
G     4
T     1
Name: count, dtype: int64

In [31]:
mapping = {
    'A': 0,
    'B': 1,
    'C': 2,
    'D': 3,
    'E': 4,
    'F': 5,
    'G': 6,
    'T': 7
}
train['Cabin'] = train['Cabin'].str[:1]
train['Cabin'] = train['Cabin'].map(mapping)
train['Cabin'] = train.groupby('Pclass')['Cabin'].transform('median')

train['Cabin'].value_counts()

Cabin
5.0    491
2.0    216
4.5    184
Name: count, dtype: int64

In [32]:
test['Cabin'] = test['Cabin'].str[:1]
test['Cabin'] = test['Cabin'].map(mapping)
test['Cabin'] = test.groupby('Pclass')['Cabin'].transform('median')

test['Cabin'].value_counts()

Cabin
5.0    311
2.0    107
Name: count, dtype: int64

In [33]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Family,Solo,FareBin,Title
0,1,0,3,"Braund, Mr. Owen Harris",1,3.0,A/5 21171,0,5.0,2,2,False,"(-0.001, 7.854]",2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,6.0,PC 17599,4,2.0,0,2,False,"(39.688, 512.329]",3
2,3,1,3,"Heikkinen, Miss. Laina",0,3.0,STON/O2. 3101282,1,5.0,2,1,True,"(7.854, 10.5]",1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,5.0,113803,4,2.0,2,2,False,"(39.688, 512.329]",3
4,5,0,3,"Allen, Mr. William Henry",1,5.0,373450,1,5.0,2,1,True,"(7.854, 10.5]",2

In [35]:
'''
import seaborn as sns

sns.heatmap(train.corr(),annot=True,cmap='RdYlGn',linewidths=0.2) #data.corr()-->correlation matrix
fig=plt.gcf()
fig.set_size_inches(20,12)
plt.show()
'''

"\nimport seaborn as sns\n\nsns.heatmap(train.corr(),annot=True,cmap='RdYlGn',linewidths=0.2) #data.corr()-->correlation matrix\nfig=plt.gcf()\nfig.set_size_inches(20,12)\nplt.show()\n"

# 모델링

In [ ]:
feature = [
    'Pclass',
    'Sex',
    'Embarked',
    'Family',
    'Solo',
    'Title',
    'Age',
    'Cabin',
    'Fare',
]

label = [
    'Survived',
]

In [ ]:

'''
from sklearn.model_selection import KFold, cross_val_score
from sklearn.ensemble import RandomForestClassifier

# train과 test 데이터프레임을 합친 후 원-핫 인코딩을 적용
combined_data = pd.concat([train[feature], test[feature]], axis=0)
combined_data = pd.get_dummies(combined_data)

# 다시 train과 test 데이터로 분리
train_size = len(train)
train_data = combined_data[:train_size]
test_data = combined_data[train_size:]

# RandomForestClassifier 모델을 적용하기 위해 데이터와 타겟을 재정의
data = train_data
target = train[label]
k_fold = KFold(n_splits=10, shuffle=True, random_state=0)

clf = RandomForestClassifier(n_estimators=50, max_depth=6, random_state=0)
cross_val_score(clf, data, target, cv=k_fold, scoring='accuracy', ).mean()
'''

In [ ]:
from sklearn.model_selection import KFold, cross_val_score
from sklearn.ensemble import RandomForestClassifier

data = train[feature]
target = train[label]

k_fold = KFold(n_splits=10, shuffle=True, random_state=0)

clf = RandomForestClassifier(n_estimators=50, max_depth=6, random_state=0)
cross_val_score(clf, data, target, cv=k_fold, scoring='accuracy', ).mean()

In [ ]:
x_train = train[feature]
x_test = test[feature]
y_train = train[label]

clf = RandomForestClassifier(n_estimators=50, max_depth=6, random_state=0)
clf.fit(x_train, y_train)
gender_submission['Survived'] = clf.predict(x_test)
gender_submission.to_csv('titanic-submission.csv',index=False)

In [ ]:
'''
x_train = train[feature]
x_test = test[feature]
y_train = train[label]

clf = RandomForestClassifier(n_estimators=50, max_depth=6, random_state=0)
clf.fit(x_train, y_train)

# 예측 결과를 gender_submission 데이터프레임에 저장
gender_submission = pd.DataFrame()
gender_submission['PassengerId'] = test['PassengerId']
gender_submission['Survived'] = clf.predict(x_test)

# 예측 결과를 CSV 파일로 저장
gender_submission.to_csv('titanic_submission.csv', index=False)

'''